판다스 - 데이터 분석도구
- 구성 요소 3가지
    - Series : 1개의 칼럼 값만으로 1차원 데이터셋
    - DataFrame : Column X Raw 2차원 데이터셋(테이블 구조)
    - Index : 고유한 Key 값

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt

In [ ]:
# 예시 데이터프레임 생성
data = {
    "USD": [1.1, 1.2, 1.3, 1.4, 1.5],
    "EUR": [1.3, 1.4, 1.5, 1.6, 1.7]
}
df = pd.DataFrame(data)

In [ ]:
df

In [ ]:
#시각화
df.plot(figsize=(7,4), title="네이버환율정보", grid=True)
# 차트를 보여주기 위한 명령
plt.show()

#### Series 구조
- Pandas가 제공하는 객체
- 객체 생성: 생성자 호출 -> 전번 초기화 - 파라미터에 아무것도 없는 것 : 디폴트 생성자
- pd는 Series의 소유주
- Series(list가 올수 있다.)

In [1]:
import pandas as pd # 대문자가 들어가면 클랴스라고 생각하기!
se = pd.Series()

In [2]:
type([1,2,3])

list

In [3]:
type({"mem_id":"kiwi"})
se = pd.Series({"mem_id":"kiwi"})

In [4]:
import pandas as pd
se = pd.Series([1, 2, 3, 4, 5])

특정값 추출 - values, index

In [6]:
print(se[0])
print(se[3])

1
4

In [7]:
# 파라미터에 리스트도 딕셔너리도 튜플도 된다.
se = pd.Series((1,2,3))

In [9]:
se[len(se)-1]

np.int64(3)

In [11]:
se[2]

np.int64(3)

In [12]:
se[len(se)-1] == se[2]

np.True_

In [14]:
se = pd.Series([1, 2, 3, 4, 5])
se.index

RangeIndex(start=0, stop=5, step=1)

In [15]:
se.values # Series 안에 Numpy가 포함되어 있다.

array([1, 2, 3, 4, 5])

In [17]:
## index변셩
se.index = ['a','b','c','d','e']
se

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [19]:
print(se['a'])
print(se['d'])
print(se['e'])

1
4
5

index 이름 명시하여 Series 생성하기

In [24]:
# Series 생성 2 - index명시
# Series 에서는 (파라미터1,파라미터2...)
se2 = pd.Series([1,2,3,4,5], index = ['a','b','c','d','e'])
se2.name = "numberOrder" # value 이름
se2.index.name = "numName" # index이름
se2

numName
a    1
b    2
c    3
d    4
e    5
Name: numberOrder, dtype: int64

In [25]:
se2 > 2

numName
a    False
b    False
c     True
d     True
e     True
Name: numberOrder, dtype: bool

In [26]:
se[se >2]

c    3
d    4
e    5
dtype: int64

In [27]:
se[se < 3]

a    1
b    2
dtype: int64

In [30]:
se[-(se > 2)]

a    1
b    2
dtype: int64

In [31]:
se.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

DataFrame (데이터 프레임)
- Pandas에서 행과 열을 가지는 자료구조
- 데이터 프레임은 2차원이므로 행 방향 인덱스와 열 방향 인덱스가 존재
- 데이터 프레임은 열, 인덱스, 값으로 구성됨

In [32]:
data = {'name':['Lee','Park','Kim','Choi']
            ,'score':[85, 90, 100, 70]
            , 'grade':['B','A','A','C']}
df = pd.DataFrame(data)
df

   name  score grade
0   Lee     85     B
1  Park     90     A
2   Kim    100     A
3  Choi     70     C

In [33]:
df = pd.DataFrame(data, columns=['name', 'grade', 'score'])
df

   name grade  score
0   Lee     B     85
1  Park     A     90
2   Kim     A    100
3  Choi     C     70

In [34]:
df.values

array([['Lee', 'B', 85],
       ['Park', 'A', 90],
       ['Kim', 'A', 100],
       ['Choi', 'C', 70]], dtype=object)

In [35]:
df.columns

Index(['name', 'grade', 'score'], dtype='object')

In [36]:
df.index.name = 'No'
df.columns.name = 'info'
df

info  name grade  score
No
0      Lee     B     85
1     Park     A     90
2      Kim     A    100
3     Choi     C     70

In [37]:
# 특정값 추출하기
df['name'].values

array(['Lee', 'Park', 'Kim', 'Choi'], dtype=object)

In [39]:
# 로우와 컬럼 지정으로 특정값 추출
df.loc[1, 'name']

'Park'

In [40]:
df = df.set_index('name')
df.loc['Choi','grade']

'C'

In [41]:
df

info grade  score
name
Lee      B     85
Park     A     90
Kim      A    100
Choi     C     70

In [43]:
# DataFrame을 딕셔너리로 변환
df.to_dict()

{'grade': {'Lee': 'B', 'Park': 'A', 'Kim': 'A', 'Choi': 'C'},
 'score': {'Lee': 85, 'Park': 90, 'Kim': 100, 'Choi': 70}}

In [45]:
import numpy as np
array = np.array([['Lee', 100, 'a'], ['Park', 95, 'A'], ['Kim', 85, 'b']])
df = pd.DataFrame(data, columns=['name', 'score', 'grade'])
df

   name  score grade
0   Lee     85     B
1  Park     90     A
2   Kim    100     A
3  Choi     70     C

In [47]:
df.values

array([['Lee', 85, 'B'],
       ['Park', 90, 'A'],
       ['Kim', 100, 'A'],
       ['Choi', 70, 'C']], dtype=object)

데이터 설렉션 및 필터링         
1) [] - 컬럼기반 필터링 또는 불린 인덱싱 필터링 제공        
(ex: df, 컬럼명, df["컬럼명], df[1:3], df[:2])
2) loc[인덱스명, 컬럼명] - 명칭(label) 기반 인덱싱
- index명, column명 기준으로 데이터가 조회됨
(ex: 하나의 행만 검색 - df.loc[0])

In [48]:
df.name

0     Lee
1    Park
2     Kim
3    Choi
Name: name, dtype: object

In [49]:
df['name']

0     Lee
1    Park
2     Kim
3    Choi
Name: name, dtype: object

In [50]:
# 콜론 앞에 숫자는 시작되는 index 이고 콜론뒤에 숫자는  미포함
df[1:3]

   name  score grade
1  Park     90     A
2   Kim    100     A

In [51]:
df[:3]

   name  score grade
0   Lee     85     B
1  Park     90     A
2   Kim    100     A

In [52]:
df[:-1]

   name  score grade
0   Lee     85     B
1  Park     90     A
2   Kim    100     A

2) loc[인덱스명, 컬럼명] - 명칭(label) 기반 인덱싱          
- index명, column명 기준으로 데이터가 조회됨            
(ex: 하나의 행만 검색 - df.loc[0])

In [53]:
df.loc[0]

name     Lee
score     85
grade      B
Name: 0, dtype: object

In [55]:
df.loc[0][0]

C:\Users\userpc\AppData\Local\Temp\ipykernel_9116\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Lee'

In [57]:
# 여러행을 검색할때
df.loc[[0,1]]

   name  score grade
0   Lee     85     B
1  Park     90     A

In [59]:
# 여러 행과 열 검색할때
df.loc[0:2, ['score', 'grade']]

   score grade
0     85     B
1     90     A
2    100     A

In [60]:
df.name

0     Lee
1    Park
2     Kim
3    Choi
Name: name, dtype: object

In [61]:
df['name']

0     Lee
1    Park
2     Kim
3    Choi
Name: name, dtype: object

In [62]:
df[['name','grade']]

   name grade
0   Lee     B
1  Park     A
2   Kim     A
3  Choi     C

In [63]:
df.loc[[0,2]]

  name  score grade
0  Lee     85     B
2  Kim    100     A

In [64]:
df.loc[0:2]

   name  score grade
0   Lee     85     B
1  Park     90     A
2   Kim    100     A

iloc[인덱스 ,컬럼인덱스] - 위치기반 index           
- 0을 출발점으로 하는 가로축, 세로축 좌표 기반의 챙과 열 위치를 기반으로 데이터를 지정          
- 행, 열 위치 값으로 정수를 사용할 수 있음, 오직 인덱스 기준으로 데이터를 가져옴

In [66]:
df.iloc[0:3, 0:2]

   name  score
0   Lee     85
1  Park     90
2   Kim    100

In [67]:
df.iloc[0:2, 0:1]

   name
0   Lee
1  Park

4. 불린(boolean) 인덱스

In [68]:
df.loc[df['score']> 90]

  name  score grade
2  Kim    100     A

In [69]:
df

   name  score grade
0   Lee     85     B
1  Park     90     A
2   Kim    100     A
3  Choi     70     C

In [70]:
df.loc[df['grade']== 'A']

   name  score grade
1  Park     90     A
2   Kim    100     A